app/views/home/index.html.haml

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  %tr
    - owner = User.find(capsul.user_id) if capsul