app/views/capsuls/index.html.haml

      %td= capsul.video
      - owner = User.find(capsul.user_id) if capsul
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]