app/views/capsuls/show.html.haml

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  %b User:
  = User.find(@capsul.user_id).username

SELECT "comments".* FROM "comments" WHERE "comments"."capsul_id" = 1
---
%h4 Comments
- @capsul.comments.each do |comment|