app/controllers/capsuls_controller.rb

SELECT "capsuls".* FROM "capsuls"
---
  def index
    @capsuls = Capsul.all

SELECT "capsuls".* FROM "capsuls" WHERE "capsuls"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @capsul = Capsul.find(params[:id])

SELECT "capsuls".* FROM "capsuls" WHERE "capsuls"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @capsul = Capsul.find(params[:id])

INSERT INTO "capsuls" ("content", "created_at", "updated_at", "user_id", "video") VALUES (?, ?, ?, ?, ?)  [["content", "egweewfw"], ["created_at", Thu, 25 Oct 2012 22:11:34 UTC +00:00], ["updated_at", Thu, 25 Oct 2012 22:11:34 UTC +00:00], ["user_id", 9], ["video", "fwefwe"]]
UPDATE "users" SET "capsules" = 2, "updated_at" = '2012-10-27 16:01:05.551392' WHERE "users"."id" = 1
---
  def create

    # FAIRE UN PARSEUR POUR LA STRING VIDEO ET CHOPER ID VIDEO YOUTUBE ONLY !!!
    @capsul = Capsul.new(params[:capsul])
    @capsul.user_id = current_user.id
    respond_to do |format|
      if @capsul.save
        # add +1 capsule to user profile
        if current_user.capsules.nil?
          current_user.capsules = 0
        end
        current_user.capsules += 1
        current_user.save

SELECT "capsuls".* FROM "capsuls" WHERE "capsuls"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @capsul = Capsul.find(params[:id])

SELECT "capsuls".* FROM "capsuls" WHERE "capsuls"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "capsules" = 1, "updated_at" = '2012-10-27 16:03:05.001406' WHERE "users"."id" = 1
DELETE FROM "capsuls" WHERE "capsuls"."id" = ?  [["id", 1]]
---
  def destroy
    @capsul = Capsul.find(params[:id])
    user = User.find(@capsul.user_id)
    if user.capsules and user.capsules > 0
      user.capsules -= 1
      user.save
    end
    @capsul.destroy