app/controllers/capsuls_controller.rb

  def show
    @capsul = Capsul.find(params[:id])
    @owner = User.find(@capsul.user_id) if @capsul
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def create
    user = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1