app/controllers/comments_controller.rb

  def create
    @capsul = Capsul.find(params[:capsul_id])
    @comment = @capsul.comments.new
    @comment.content = params[:comment][:content]
    @comment.user_id = current_user.id
    @comment.save
---
SELECT "capsuls".* FROM "capsuls" WHERE "capsuls"."id" = ? LIMIT 1  [["id", "6"]]
INSERT INTO "comments" ("capsul_id", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["capsul_id", 6], ["content", "ok on fait un test motha fuckaaaaaaa"], ["created_at", Fri, 26 Oct 2012 08:38:07 UTC +00:00], ["updated_at", Fri, 26 Oct 2012 08:38:07 UTC +00:00], ["user_id", nil]]