app/controllers/home_controller.rb

SELECT "capsuls".* FROM "capsuls" ORDER BY created_at desc LIMIT 10
SELECT "capsuls".* FROM "capsuls"
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def index
    @limit = 10
    @offset = 0
    if params[:limit] and Integer(params[:limit]) > 100
      @limit = 100
    end
    if params[:offset]
      @offset = Integer(params[:offset])
    end
    @capsuls = Capsul.order('created_at DESC').limit(@limit).offset(@offset).all
    @user_capsuls = nil
    @random_capsuls = Capsul.order("RANDOM()").limit(@limit).offset(@offset).all
    if current_user
      user = User.find(current_user.id)