app/controllers/omniauth_controller.rb

  def facebook
    auth = request.env['omniauth.auth']
    extra = auth[:extra]
    facebook_email = extra[:raw_info][:email]
    user = User.find_by_email(facebook_email)
    if user.nil? and current_user.nil?
      user = new_user extra, auth, 'fb'
      user.user_token.fb_id = extra[:raw_info][:id]
      user.user_token.save
    elsif current_user and current_user.user_token.nil?
      facebook_email = user_no_token 'fb', extra, auth
      current_user.user_token.fb_id = extra[:raw_info][:id]
      current_user.user_token.save
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'thibault.prat@hotmail.fr' LIMIT 1
UPDATE "users" SET "last_sign_in_at" = '2012-10-30 22:13:36.057904', "current_sign_in_at" = '2012-10-30 22:13:50.305326', "sign_in_count" = 3, "updated_at" = '2012-10-30 22:13:50.306605' WHERE "users"."id" = 1
INSERT INTO "users" ("active", "capsules", "created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "gender", "last_sign_in_at", "last_sign_in_ip", "location", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "title", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)