app/controllers/profile_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 8 LIMIT 1
---
  def profile
    @user_profile = User.find(params[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
  def step
    @me = User.find(current_user.id)

UPDATE "users" SET "active" = 't', "capsules" = 0, "username" = 'sebastien', "location" = 'Paris France', "gender" = 1, "updated_at" = '2012-10-28 12:09:40.121510' WHERE "users"."id" = 3
---
  def validate_step
    current_user.active = true
    current_user.capsules = 0
    current_user.username = params[:user][:username]
    current_user.location = params[:user][:location]
    current_user.gender = params[:user][:gender]
    current_user.save